Revit 2024 API
ParameterTypeId.JoistSystemLayoutRuleParam Property
 "Layout Rule"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId JoistSystemLayoutRuleParam { get; }
Visual Basic
Public Shared ReadOnly Property JoistSystemLayoutRuleParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ JoistSystemLayoutRuleParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace